In [1]:
import pandas as pd

<hr>

# csvの読み込み

事前にcsvのファイルと中身表示

In [2]:
with open('csv/read_sample.csv','r') as f:
    print(f.read())

index,name,yen
1,apple,120
2,banana,100
3,orange,80

<hr>
<hr>

###  pandasを使ってcsvを読み込む

In [3]:
df = pd.read_csv('csv/read_sample.csv')
df

   index    name  yen
0      1   apple  120
1      2  banana  100
2      3  orange   80

read_csvでcsvを読み込んだ時、デフォルトで１行目はヘッダーとして認識されて読み込まれる。

ヘッダーを認識させたくないときは、read_csvの引数headerをNoneにして実行する。

In [4]:
df = pd.read_csv('csv/read_sample.csv',header=None)
df

       0       1    2
0  index    name  yen
1      1   apple  120
2      2  banana  100
3      3  orange   80

読み込まれたデータは**pandas.DataFrame**型のデータとなる。

In [5]:
df_bkup = pd.read_csv('csv/read_sample.csv')

<hr>

### Dataframe型のデータへのアクセス

In [6]:
df = pd.read_csv('csv/read_sample.csv')
df

   index    name  yen
0      1   apple  120
1      2  banana  100
2      3  orange   80

DataFrame型のデータの内部にある読み込んできたデータを取得したい場合は、列名と行名を指定して取得する。

In [7]:
print(df['index'][0])
print(df['name'][1])
print(df['yen'][2])

1
banana
80

#### 指定した列の要素を全て置き換える

In [8]:
#yen列に0を代入
df['yen']=0
df

   index    name  yen
0      1   apple    0
1      2  banana    0
2      3  orange    0

In [9]:
df = pd.read_csv('csv/read_sample.csv')

#### 新しい列を作って値を代入する

In [10]:
#個数(num)列を作って、1を代入
df['num']=1
df

   index    name  yen  num
0      1   apple  120    1
1      2  banana  100    1
2      3  orange   80    1

#### 指定した行の要素を全て置き換える

In [11]:
#2行目に0を代入
df.loc[[2],:]=0
df

   index    name  yen  num
0      1   apple  120    1
1      2  banana  100    1
2      0       0    0    0

#### 新しい行を作って値を代入する

In [12]:
#4行目に0を代入
df.loc[4]=0
df

   index    name  yen  num
0      1   apple  120    1
1      2  banana  100    1
2      0       0    0    0
4      0       0    0    0

#### 指定した行を削除する

In [13]:
#drop関数でできるが、インプレースではない。引数には行名を入力
df = df.drop(4)
df

   index    name  yen  num
0      1   apple  120    1
1      2  banana  100    1
2      0       0    0    0

In [14]:
#引数inplaceをTrueにするとインプレースで実行できる
df.drop(2,inplace=True)
df

   index    name  yen  num
0      1   apple  120    1
1      2  banana  100    1

In [15]:
#削除したい行をリストで複数指定できる。指定された表が全て削除される
df.drop([0,1],inplace=True)
df

Empty DataFrame
Columns: [index, name, yen, num]
Index: []

In [16]:
#戻す
df = pd.read_csv('csv/read_sample.csv')
df

   index    name  yen
0      1   apple  120
1      2  banana  100
2      3  orange   80

#### 指定した列を削除する

In [17]:
#drop関数でできるが、列の場合は引数axis=1にする（axisはデフォルトで0(行方向)になる）
df.drop('yen',axis=1,inplace=True)
df

   index    name
0      1   apple
1      2  banana
2      3  orange

In [19]:
#行と同様に削除したい列をリストで複数指定できる
df.drop(['index','name'],axis=1,inplace=True)
df

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [20]:
#戻す
df = pd.read_csv('csv/read_sample.csv')
df

   index    name  yen
0      1   apple  120
1      2  banana  100
2      3  orange   80